# brew command-line tools using Homebrew
# Usage: `brew bundle Brewfile`

tap "gapple/services"

# Make sure we’re using the latest Homebrew
# brew update

# Upgrade any already-installed formulae
# brew upgrade

# brew packages
brew "ack"
brew "aspell"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bash"
brew "cabextract"
brew "cloc"
brew "cmake"
brew "colordiff"
brew "curl"
brew "fig"
brew "gawk"
brew "gdbm"
brew "gist"
brew "git"
brew "gnu-sed"
brew "gnutls"
brew "go"
brew "graphviz"
brew "htop-osx"
brew "hub"
brew "iperf"
brew "isync"
brew "libxml2"
brew "libxslt"
brew "libyaml"
brew "lynx"
brew "mcrypt"
brew "media-info"
brew "memcache-top"
brew "mercurial"
brew "monit"
brew "mpssh"
brew "nginx"
brew "nmap"
brew "node"
brew "npm"
brew "parallel"
brew "pwgen"
brew "python"
brew "R"
brew "rename"
brew "rlwrap"
brew "tig"
brew "trash"
brew "tree"
brew "unrar"
brew "watch"
brew "wget"

# brew databases and search engines
brew "memcached"
brew "mysql"
brew "redis"
brew "postgresql"
brew "postgis"

# brew image processing packages
brew "imagemagick"
brew "exiftool"
brew "ufraw"
brew "jpegoptim"
brew "librsvg"

# brew video packages
brew "mediainfo"
brew "ffmpeg"
brew "gpac"
brew "mkvtoolnix"
brew "mplayer"

# brew cleanup


# Install native apps
# Usage: `brew bundle Caskfile`

# brew "caskroom/cask/brew-cask"
# tap "caskroom/versions"
# tap "caskroom/fonts"

# main apps
# cask "clipmenu"
cask "libreoffice"
cask "spectacle"
cask "the-unarchiver"
cask "appcleaner"
cask "tor-browser"

# browsers
cask "google-chrome"
cask "firefox"

# communication
cask "skype"

# java
cask "java" # java8
# cask java7
# cask java6

# storage apps
# cask cloud
cask "dropbox"
cask "google-drive-file-stream"
cask "cyberduck"
cask "transmission"

# development apps
cask "iterm2"
# cask textmate
# cask atom
cask "sublime-text"
cask "macvim"
cask "github"
# cask vagrant
# cask virtualbox
# cask virtualbox-extension-pack
# cask sequel-pro
cask "postico"
cask "pgadmin3"
# cask heroku-toolbelt
# cask "boot2docker"
# cask "docker-compose"
cask "android-sdk"
cask "intel-haxm" # for android-sdk

# image processing apps
cask "seashore"
cask "imageoptim"
cask "skitch"
cask "sketch"
# cask "inkscape # requires xquartz
cask "xquartz"
cask "adobe-dng-converter"
# cask raw-therapee
# cask gimp-lisanet
# cask raw-photo-processor
# cask darktable
# cask camerabag

# music apps
# cask spotify
# cask audacity

# video apps
cask "mplayerx"
# cask "miro-video-converter"
cask "vlc"
cask "handbrake"
cask "subler"
cask "subtitles"
# cask "identify"
# cask "airflick"

# fonts
cask "font-open-sans"
cask "font-roboto"
cask "font-noto-sans"
cask "font-pt-sans"
# cask "font-droid-sans"
# cask "font-titillium-web"
cask "font-oswald"
cask "font-play"
cask "font-lato"
cask "font-inconsolata"
cask "font-clear-sans"
cask "font-source-sans-pro"
cask "font-raleway"
# cask "font-casper"
cask "font-gidole"
cask "font-dosis"

# fun
# cask cathode

